read_verilog regfile_onlyread.v
proc; opt; check -assert
proc; opt
techmap; opt; flatten
write_smt2 smt_regonlyread.smt2